src/mod_fsklearn_essential.org
* Mod_Fsklearn_Essential
#+options: ^:nil

  - In this module, some essential parts for the fsklearn
    are defined. They include the basic class Fsklearn_IO
three types of essential
    functions, some files and some derived type variables.
 - They will be used in mod_fsklearn to build the full
    machine learning module.
** Public classes
  - *Fsklearn_IO*
  - *Neural_Nwtwoek*
  - *Decision_Tree*
  - *Random_Forest*
** *Fsklearn_IO* class
 Contains the genetic procedures for a machine learning training and prediction. 

