src/mod_fsklearn_essential.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-31 Wed 17:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yeldon" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4ca0957">1. Mod_Fsklearn_Essential</a>
<ul>
<li><a href="#org6cc92cc">1.1. Public classes</a></li>
<li><a href="#orgdf5547c">1.2. <b>Fsklearn_IO</b> class</a>
<ul>
<li><a href="#orgf509b66">1.2.1. List of the variables in the class</a></li>
</ul>
</li>
<li><a href="#orgc4a2a39">1.3. Common_Initialization</a></li>
<li><a href="#org46fb25d">1.4. Common_Read_Coef</a></li>
<li><a href="#org9dfcd95">1.5. NN_Read_Coef</a></li>
<li><a href="#org012d786">1.6. DT_Read_Coef</a></li>
<li><a href="#orgfd8a245">1.7. RF_Read_Coef</a></li>
<li><a href="#org324a075">1.8. NN_Predict_One</a></li>
<li><a href="#org46cf1f1">1.9. DT_Predict_One</a></li>
<li><a href="#org8118e9d">1.10. RF_Predict_One</a></li>
<li><a href="#org415c32e">1.11. Activation_logistic</a></li>
<li><a href="#org69b593a">1.12. Activation_tanh</a></li>
<li><a href="#org95e7212">1.13. Activation_ReLU</a></li>
<li><a href="#org6cbc1ff">1.14. Activation_identity</a></li>
<li><a href="#org007da0c">1.15. Activation_softmax</a></li>
<li><a href="#org3870b43">1.16. Write_Line_Integer</a></li>
<li><a href="#org4a90cd1">1.17. Write_Line_Real</a></li>
<li><a href="#orgafd2eed">1.18. Generate_Training_Python</a></li>
<li><a href="#org035bd16">1.19. PY_main</a></li>
<li><a href="#org7a212e3">1.20. Py_import</a></li>
<li><a href="#org1dc70d3">1.21. PY_sk2f</a></li>
<li><a href="#org620c7e9">1.22. Common_Read_and_Update_Param</a></li>
<li><a href="#org792334a">1.23. NN_Read_and_Update_Param</a></li>
<li><a href="#orgce77b8e">1.24. DT_Read_and_Update_Param</a></li>
<li><a href="#org5e8b600">1.25. RF_Read_and_Update_Param</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4ca0957" class="outline-2">
<h2 id="org4ca0957"><span class="section-number-2">1</span> Mod_Fsklearn_Essential</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>In this module, some essential parts for the fsklearn
are defined. They include the basic class Fsklearn_IO</li>
</ul>
<p>
three types of essential
    functions, some files and some derived type variables.
</p>
<ul class="org-ul">
<li>They will be used in mod_fsklearn to build the full
machine learning module.</li>
</ul>
</div>
<div id="outline-container-org6cc92cc" class="outline-3">
<h3 id="org6cc92cc"><span class="section-number-3">1.1</span> Public classes</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b>Fsklearn_IO</b></li>
<li><b>Neural_Nwtwoek</b></li>
<li><b>Decision_Tree</b></li>
<li><b>Random_Forest</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgdf5547c" class="outline-3">
<h3 id="orgdf5547c"><span class="section-number-3">1.2</span> <b>Fsklearn_IO</b> class</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Contains the genetic procedures for a machine learning training and prediction. 
</p>
</div>
