src/mod_fsklearn_essential.html

<div id="outline-container-orgf509b66" class="outline-4">
<h4 id="orgf509b66"><span class="section-number-4">1.2.1</span> List of the variables in the class</h4>
<div class="outline-text-4" id="text-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">traininig_type</td>
<td class="org-left">the type of training. now should be</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><b>neural_network</b>, <b>decision_tree</b>, or <b>random_forest</b>.</td>
</tr>

<tr>
<td class="org-left">training_script</td>
<td class="org-left">the python script generated by fortran code</td>
</tr>

<tr>
<td class="org-left">n_inputs</td>
<td class="org-left">count of input variables</td>
</tr>

<tr>
<td class="org-left">n_outputs</td>
<td class="org-left">count of output variables</td>
</tr>

<tr>
<td class="org-left">train_after_run</td>
<td class="org-left">whether to run after training</td>
</tr>

<tr>
<td class="org-left">num_para</td>
<td class="org-left">numbers of coefficient from the training</td>
</tr>

<tr>
<td class="org-left">key</td>
<td class="org-left">the list of coefficient keys,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the length of the <code>key</code> is <code>num_para</code></td>
</tr>

<tr>
<td class="org-left">value</td>
<td class="org-left">the list of parameter values,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the length of the <code>value</code> is <code>num_para</code></td>
</tr>

<tr>
<td class="org-left">coef_files_path</td>
<td class="org-left">the path of the coefficient files</td>
</tr>

<tr>
<td class="org-left">coef_file_name</td>
<td class="org-left">the name of the coefficient file</td>
</tr>

<tr>
<td class="org-left">set_ml_file</td>
<td class="org-left">the <code>namelist</code> file for fortran code</td>
</tr>

<tr>
<td class="org-left">training_data_path</td>
<td class="org-left">the path of training data</td>
</tr>

<tr>
<td class="org-left">training_input_name</td>
<td class="org-left">the name of the training input file</td>
</tr>

<tr>
<td class="org-left">training_output_name</td>
<td class="org-left">the name of the trainign output file</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Use of modules:</li>
</ul>

<p>
<b>None</b>
</p>

<ul class="org-ul">
<li>list of variables:</li>
</ul>

<div class="org-src-container">
<pre class="src src-fortran">
  Private

  Public :: Write_Line
  Public :: Fsklearn_IO
  Public :: Neural_Network
  Public :: Decision_Tree
  Public :: Random_Forest

  <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Subject to the choice of precision.</span>
  <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Single precision by default</span>
<span style="color: #bc6ec5;"># if defined</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">DOUBLE_PRECISION</span><span style="color: #4f97d7;">)</span>
  <span style="color: #ce537a; font-weight: bold;">Integer</span>, <span style="color: #ce537a; font-weight: bold;">Parameter</span> :: PS = <span style="color: #a45bad;">8</span>
<span style="color: #bc6ec5;"># else</span>
  <span style="color: #ce537a; font-weight: bold;">Integer</span>, <span style="color: #ce537a; font-weight: bold;">Parameter</span> :: PS = <span style="color: #a45bad;">4</span>
<span style="color: #bc6ec5;"># endif</span>

  Type String
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">50</span><span style="color: #4f97d7;">)</span> :: str
  <span style="color: #4f97d7; font-weight: bold;">End</span> type String

  Type :: Fsklearn_IO
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">20</span><span style="color: #4f97d7;">)</span> :: training_type
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1000</span><span style="color: #4f97d7;">)</span> :: Training_script
    <span style="color: #ce537a; font-weight: bold;">Integer</span> :: n_inputs
    <span style="color: #ce537a; font-weight: bold;">Integer</span> :: n_outputs
    <span style="color: #ce537a; font-weight: bold;">Logical</span> :: train_after_run
    <span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Allocatable :: Inputs<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    <span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Allocatable :: Outputs<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    <span style="color: #ce537a; font-weight: bold;">Integer</span> :: num_para
    Type<span style="color: #4f97d7;">(</span>String<span style="color: #4f97d7;">)</span> , Allocatable :: key<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    Type<span style="color: #4f97d7;">(</span>String<span style="color: #4f97d7;">)</span> , Allocatable :: value<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span> :: Coef_files_path      = <span style="color: #2d9574;">'./'</span>
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span> :: Coef_File_Name       = <span style="color: #2d9574;">''</span> <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span> :: set_ML<span style="color: #2aa1ae; background-color: #292e34;">_file          = 'fsklearn_coef.namelist'</span>
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span> :: training_py          = <span style="color: #2d9574;">'training.py'</span>
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span> :: training_data_path   = <span style="color: #2d9574;">'./'</span>
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span> :: training_input_name  = <span style="color: #2d9574;">'training_input'</span>
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span> :: training_output_name = <span style="color: #2d9574;">'training_output'</span>
  Contains
    Procedure :: Common_Initialization
    Procedure , pass<span style="color: #4f97d7;">(</span>self<span style="color: #4f97d7;">)</span> :: Read_Coef =&gt; Common_Read_Coef
    Procedure :: Gen_PY =&gt; Generate_Training_Python
    Procedure :: Read_Training_Param =&gt; Common_Read_and_Update_Param
    Procedure :: Generate_Parameter_Script
    Procedure :: Py_Import
    Procedure :: PY_main
    Procedure :: PY_sk2f
  <span style="color: #4f97d7; font-weight: bold;">End</span> Type Fsklearn_IO

  <span style="color: #2aa1ae; background-color: #292e34;">!&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;</span><span style="color: #2aa1ae; background-color: #292e34;">Neural Networks variables&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;</span>

  Type Ragged_Vector
    <span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Allocatable :: Vec<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">End</span> Type Ragged_vector

  Type Ragged_Matrix
    <span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Allocatable :: Mat<span style="color: #4f97d7;">(</span>:,:<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">End</span> Type Ragged_Matrix

  Type :: NN_activation
    Procedure<span style="color: #4f97d7;">(</span>Sub_Interface<span style="color: #4f97d7;">)</span>, Pointer, NoPass :: activate =&gt; NULL<span style="color: #4f97d7;">()</span>
  <span style="color: #4f97d7; font-weight: bold;">End</span> Type NN_activation

  <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">interface for choose activation type</span>
  Interface
    <span style="color: #4f97d7; font-weight: bold;">Function</span> <span style="color: #bc6ec5; font-weight: bold;">Sub_Interface</span><span style="color: #4f97d7;">(</span>n, X<span style="color: #4f97d7;">)</span>
      Import :: PS
      <span style="color: #ce537a; font-weight: bold;">Integer</span>,  Intent<span style="color: #4f97d7;">(</span>in<span style="color: #4f97d7;">)</span> :: n
      <span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Intent<span style="color: #4f97d7;">(</span>in<span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">Dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: X
      <span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">Dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: Sub_Interface
    <span style="color: #4f97d7; font-weight: bold;">End</span> <span style="color: #4f97d7; font-weight: bold;">Function</span> <span style="color: #bc6ec5; font-weight: bold;">Sub_Interface</span>
  <span style="color: #4f97d7; font-weight: bold;">End</span> Interface

  <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">neural network coefficients</span>
  Type, Extends<span style="color: #4f97d7;">(</span>Fsklearn_IO<span style="color: #4f97d7;">)</span> :: Neural_Network
    <span style="color: #ce537a; font-weight: bold;">Integer</span> :: layers
    <span style="color: #ce537a; font-weight: bold;">Integer</span>, Allocatable :: Layer_Size<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    Type<span style="color: #4f97d7;">(</span>Ragged_Vector<span style="color: #4f97d7;">)</span>, Allocatable :: Activations<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    Type<span style="color: #4f97d7;">(</span>Ragged_Vector<span style="color: #4f97d7;">)</span>, Allocatable :: Intercepts<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    Type<span style="color: #4f97d7;">(</span>Ragged_Matrix<span style="color: #4f97d7;">)</span>, Allocatable :: Coefs<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">10</span><span style="color: #4f97d7;">)</span> :: Activation_type
    <span style="color: #ce537a; font-weight: bold;">Character</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">10</span><span style="color: #4f97d7;">)</span> :: out_Activation_type
    Type<span style="color: #4f97d7;">(</span>NN_Activation<span style="color: #4f97d7;">)</span> :: Activation
    Type<span style="color: #4f97d7;">(</span>NN_Activation<span style="color: #4f97d7;">)</span> :: Out_Activation
    Contains
      Procedure :: Read_Coef =&gt; NN_Read_Coef
      Procedure :: Predict_One =&gt; NN_Predict_One
      <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Procedure :: Predict_Vec =&gt; NN_Predict_Vec</span>
      <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Procedure :: Predict_Mat =&gt; NN_Predict_Mat</span>
      Procedure :: Read_Training_Param =&gt; NN_Read_and_Update_Param
  <span style="color: #4f97d7; font-weight: bold;">End</span> Type Neural_Network
  <span style="color: #2aa1ae; background-color: #292e34;">!&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;</span><span style="color: #2aa1ae; background-color: #292e34;">End Neural Network Variables&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;</span>


  <span style="color: #2aa1ae; background-color: #292e34;">!&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;</span><span style="color: #2aa1ae; background-color: #292e34;">Decision Tree Variables&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;</span>
  Type Nodes
    <span style="color: #ce537a; font-weight: bold;">Integer</span>  :: children_left
    <span style="color: #ce537a; font-weight: bold;">Integer</span>  :: children_right
    <span style="color: #ce537a; font-weight: bold;">Integer</span>  :: feature
    <span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: threshold
    <span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Allocatable :: Values<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
    <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Contains</span>
  <span style="color: #4f97d7; font-weight: bold;">End</span> Type Nodes

  type Trees
    <span style="color: #ce537a; font-weight: bold;">Integer</span> :: node_count
    <span style="color: #ce537a; font-weight: bold;">Integer</span> :: max_depth
    Type<span style="color: #4f97d7;">(</span>Nodes<span style="color: #4f97d7;">)</span>, Allocatable :: Node<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7; font-weight: bold;">End</span> type Trees

  Type, Extends<span style="color: #4f97d7;">(</span>Fsklearn_IO<span style="color: #4f97d7;">)</span> :: Decision_Tree
    Type<span style="color: #4f97d7;">(</span>Trees<span style="color: #4f97d7;">)</span> :: Tree
  Contains
    Procedure :: Read_Coef =&gt; DT_Read_Coef
    Procedure :: Predict_One =&gt; DT_Predict_One
    <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Procedure :: Predict_Vec =&gt; DT_Predict_Vec</span>
    <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Procedure :: Predict_Mat =&gt; DT_Predict_Mat</span>
    Procedure :: Read_Training_Param =&gt; DT_Read_and_Update_Param
  <span style="color: #4f97d7; font-weight: bold;">End</span> Type Decision_Tree
  <span style="color: #2aa1ae; background-color: #292e34;">!&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;</span><span style="color: #2aa1ae; background-color: #292e34;">End Decision Tree Variables&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;</span>


  <span style="color: #2aa1ae; background-color: #292e34;">!&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;</span><span style="color: #2aa1ae; background-color: #292e34;">Random Forest Variables&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;&#8595;</span>
  Type, Extends<span style="color: #4f97d7;">(</span>Fsklearn_IO<span style="color: #4f97d7;">)</span> :: Random_Forest
    <span style="color: #ce537a; font-weight: bold;">Integer</span> :: tree_count
    Type<span style="color: #4f97d7;">(</span>Trees<span style="color: #4f97d7;">)</span>, Allocatable :: Tree<span style="color: #4f97d7;">(</span>:<span style="color: #4f97d7;">)</span>
  Contains
    Procedure :: Read_Coef =&gt; RF_Read_Coef
    Procedure :: Predict_One =&gt; RF_Predict_One
    <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Procedure :: Predict_Vec =&gt; RF_Predict_Vec</span>
    <span style="color: #2aa1ae; background-color: #292e34;">! </span><span style="color: #2aa1ae; background-color: #292e34;">Procedure :: Predict_Mat =&gt; RF_Predict_Mat</span>
    Procedure :: Read_Training_Param =&gt; RF_Read_and_Update_Param
  <span style="color: #4f97d7; font-weight: bold;">End</span> Type Random_Forest
  <span style="color: #2aa1ae; background-color: #292e34;">!&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;</span><span style="color: #2aa1ae; background-color: #292e34;">End Random Forest Variables&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;&#8593;</span>

  Interface Write_Line
    Module Procedure :: Write_Line_Real
    Module Procedure :: Write_Line_Integer
  <span style="color: #4f97d7; font-weight: bold;">end</span> Interface Write_Line


</pre>
</div>
</div>
</div>
</div>
