src/mod_fsklearn_essential.org
** Common_Initialization

- Use of modules:
#+begin_src fortran
    Use mpi
#+end_src

input variables

*None*

output variables

*None*

- list of local variables:

** Common_Read_Coef

- Use of modules:
*None*

input variables

*None*

output variables

*None*

- list of local variables:

** NN_Read_Coef

- Use of modules:
#+begin_src fortran
    Use mpi
#+end_src

input variables

*None*

output variables

*None*

- list of local variables:

** DT_Read_Coef

- Use of modules:
#+begin_src fortran
    Use mpi
#+end_src

input variables

*None*

output variables

*None*

- list of local variables:

** RF_Read_Coef

- Use of modules:
#+begin_src fortran
    Use mpi
#+end_src

input variables

*None*

output variables

*None*

- list of local variables:

** NN_Predict_One

- Use of modules:
*None*

input variables

#+begin_src fortran
    Class(Neural_Network) :: self
    Real(PS) :: input(self%n_inputs)
    Real(PS) :: input(self%n_inputs)
    Real(PS) :: NN_Predict_One(self%n_outputs)
#+end_src

output variables

#+begin_src fortran
    Real(PS) :: NN_Predict_One(self%n_outputs)
#+end_src

- list of local variables:

*None*

** DT_Predict_One

- Use of modules:
*None*

input variables

#+begin_src fortran
    Class(Decision_Tree) :: self
    Real(PS) :: input(self%n_inputs)
    Real(PS) :: input(self%n_inputs)
    Real(PS) :: DT_Predict_One(self%n_outputs)
#+end_src

output variables

#+begin_src fortran
    Real(PS) :: DT_Predict_One(self%n_outputs)
#+end_src

- list of local variables:

*None*

** RF_Predict_One

- Use of modules:
*None*

input variables

#+begin_src fortran
    Class(Random_Forest) :: self
    Real(PS) :: input(self%n_inputs)
    Real(PS) :: input(self%n_inputs)
    Real(PS) :: RF_Predict_One(self%n_outputs)
#+end_src

output variables

#+begin_src fortran
    Real(PS) :: RF_Predict_One(self%n_outputs)
#+end_src

- list of local variables:

*None*

** Activation_logistic

- Use of modules:
*None*

input variables

#+begin_src fortran
    integer, Intent(in) :: n
    Real(PS), Intent(in), dimension(n) :: X
    Real(PS), Intent(in), dimension(n) :: X
    Real(PS), dimension(n) :: Activation_logistic
#+end_src

output variables

#+begin_src fortran
    Real(PS), dimension(n) :: Activation_logistic
#+end_src

- list of local variables:

*None*

** Activation_tanh

- Use of modules:
*None*

input variables

#+begin_src fortran
    integer, Intent(in) :: n
    Real(PS), Intent(in), dimension(n) :: X
    Real(PS), Intent(in), dimension(n) :: X
    Real(PS), dimension(n) :: Activation_tanh
#+end_src

output variables

#+begin_src fortran
    Real(PS), dimension(n) :: Activation_tanh
#+end_src

- list of local variables:

*None*

