src/mod_fsklearn_essential.html

<div id="outline-container-orgc4a2a39" class="outline-3">
<h3 id="orgc4a2a39"><span class="section-number-3">1.3</span> Common_Initialization</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<div class="org-src-container">
<pre class="src src-fortran">Use mpi
</pre>
</div>

<p>
input variables
</p>

<p>
<b>None</b>
</p>

<p>
output variables
</p>

<p>
<b>None</b>
</p>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>
</div>
</div>

<div id="outline-container-org46fb25d" class="outline-3">
<h3 id="org46fb25d"><span class="section-number-3">1.4</span> Common_Read_Coef</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<p>
<b>None</b>
</p>

<p>
input variables
</p>

<p>
<b>None</b>
</p>

<p>
output variables
</p>

<p>
<b>None</b>
</p>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>
</div>
</div>

<div id="outline-container-org9dfcd95" class="outline-3">
<h3 id="org9dfcd95"><span class="section-number-3">1.5</span> NN_Read_Coef</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<div class="org-src-container">
<pre class="src src-fortran">Use mpi
</pre>
</div>

<p>
input variables
</p>

<p>
<b>None</b>
</p>

<p>
output variables
</p>

<p>
<b>None</b>
</p>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>
</div>
</div>

<div id="outline-container-org012d786" class="outline-3">
<h3 id="org012d786"><span class="section-number-3">1.6</span> DT_Read_Coef</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<div class="org-src-container">
<pre class="src src-fortran">Use mpi
</pre>
</div>

<p>
input variables
</p>

<p>
<b>None</b>
</p>

<p>
output variables
</p>

<p>
<b>None</b>
</p>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd8a245" class="outline-3">
<h3 id="orgfd8a245"><span class="section-number-3">1.7</span> RF_Read_Coef</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<div class="org-src-container">
<pre class="src src-fortran">Use mpi
</pre>
</div>

<p>
input variables
</p>

<p>
<b>None</b>
</p>

<p>
output variables
</p>

<p>
<b>None</b>
</p>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>
</div>
</div>

<div id="outline-container-org324a075" class="outline-3">
<h3 id="org324a075"><span class="section-number-3">1.8</span> NN_Predict_One</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<p>
<b>None</b>
</p>

<p>
input variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #2aa1ae; background-color: #292e34;">C</span><span style="color: #2aa1ae; background-color: #292e34;">lass(Neural_Network) :: self</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: input<span style="color: #4f97d7;">(</span>self%n_inputs<span style="color: #4f97d7;">)</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: input<span style="color: #4f97d7;">(</span>self%n_inputs<span style="color: #4f97d7;">)</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: NN_Predict_One<span style="color: #4f97d7;">(</span>self%n_outputs<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
output variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: NN_Predict_One<span style="color: #4f97d7;">(</span>self%n_outputs<span style="color: #4f97d7;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>

<p>
<b>None</b>
</p>
</div>
</div>

<div id="outline-container-org46cf1f1" class="outline-3">
<h3 id="org46cf1f1"><span class="section-number-3">1.9</span> DT_Predict_One</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<p>
<b>None</b>
</p>

<p>
input variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #2aa1ae; background-color: #292e34;">C</span><span style="color: #2aa1ae; background-color: #292e34;">lass(Decision_Tree) :: self</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: input<span style="color: #4f97d7;">(</span>self%n_inputs<span style="color: #4f97d7;">)</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: input<span style="color: #4f97d7;">(</span>self%n_inputs<span style="color: #4f97d7;">)</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: DT_Predict_One<span style="color: #4f97d7;">(</span>self%n_outputs<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
output variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: DT_Predict_One<span style="color: #4f97d7;">(</span>self%n_outputs<span style="color: #4f97d7;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>

<p>
<b>None</b>
</p>
</div>
</div>

<div id="outline-container-org8118e9d" class="outline-3">
<h3 id="org8118e9d"><span class="section-number-3">1.10</span> RF_Predict_One</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<p>
<b>None</b>
</p>

<p>
input variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #2aa1ae; background-color: #292e34;">C</span><span style="color: #2aa1ae; background-color: #292e34;">lass(Random_Forest) :: self</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: input<span style="color: #4f97d7;">(</span>self%n_inputs<span style="color: #4f97d7;">)</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: input<span style="color: #4f97d7;">(</span>self%n_inputs<span style="color: #4f97d7;">)</span>
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: RF_Predict_One<span style="color: #4f97d7;">(</span>self%n_outputs<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
output variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span> :: RF_Predict_One<span style="color: #4f97d7;">(</span>self%n_outputs<span style="color: #4f97d7;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>

<p>
<b>None</b>
</p>
</div>
</div>

<div id="outline-container-org415c32e" class="outline-3">
<h3 id="org415c32e"><span class="section-number-3">1.11</span> Activation_logistic</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<p>
<b>None</b>
</p>

<p>
input variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #ce537a; font-weight: bold;">integer</span>, Intent<span style="color: #4f97d7;">(</span>in<span style="color: #4f97d7;">)</span> :: n
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Intent<span style="color: #4f97d7;">(</span>in<span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: X
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Intent<span style="color: #4f97d7;">(</span>in<span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: X
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: Activation_logistic
</pre>
</div>

<p>
output variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: Activation_logistic
</pre>
</div>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>

<p>
<b>None</b>
</p>
</div>
</div>

<div id="outline-container-org69b593a" class="outline-3">
<h3 id="org69b593a"><span class="section-number-3">1.12</span> Activation_tanh</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>Use of modules:</li>
</ul>
<p>
<b>None</b>
</p>

<p>
input variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #ce537a; font-weight: bold;">integer</span>, Intent<span style="color: #4f97d7;">(</span>in<span style="color: #4f97d7;">)</span> :: n
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Intent<span style="color: #4f97d7;">(</span>in<span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: X
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, Intent<span style="color: #4f97d7;">(</span>in<span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: X
<span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: Activation_tanh
</pre>
</div>

<p>
output variables
</p>

<div class="org-src-container">
<pre class="src src-fortran"><span style="color: #ce537a; font-weight: bold;">Real</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">PS</span><span style="color: #4f97d7;">)</span>, <span style="color: #ce537a; font-weight: bold;">dimension</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> :: Activation_tanh
</pre>
</div>

<ul class="org-ul">
<li>list of local variables:</li>
</ul>

<p>
<b>None</b>
</p>
</div>
</div>
